public/goals-info-2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 12:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Information on goal setting 2024</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/../css/simple.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Information on goal setting 2024</h1>
<p>
Some videos and links on setting goals I found and my take aways. I normally set
goals but I haven&rsquo;t researched goal setting so this year so I thought I would.
</p>
<div id="outline-container-org7a53d6f" class="outline-2">
<h2 id="org7a53d6f">James Clear &rsquo;Goal setting&rsquo;</h2>
<div class="outline-text-2" id="text-org7a53d6f">
<p>
The author of &rsquo;Atomic habbits&rsquo; has a short post on goals and systems.
<a href="https://jamesclear.com/goal-setting">https://jamesclear.com/goal-setting</a>
</p>

<p>
Take aways:
</p>

<ol class="org-ol">
<li>Select the right goals and limit the goals you&rsquo;re working on at once. I&rsquo;m
going to be working exercising and procrastinating less</li>

<li>Focus the systems to reach my goals. Focus on my day to day, week to week
habits and actions and things that move me forward.</li>
</ol>
</div>
</div>
<div id="outline-container-org56413f2" class="outline-2">
<h2 id="org56413f2">Goals Toolkit: How to Set &amp; Achieve Your Goals</h2>
<div class="outline-text-2" id="text-org56413f2">
<p>
From Huberman lab podcast
Length 1:34 hours. I only watched half so far.
</p>

<p>
<a href="https://youtu.be/CrtR12PBKb0?si=BDpe1m_n0OD7VKwJ">https://youtu.be/CrtR12PBKb0?si=BDpe1m_n0OD7VKwJ</a>
</p>

<p>
Take aways:
</p>
</div>
<div id="outline-container-org3ee8176" class="outline-3">
<h3 id="org3ee8176">Pick one goal to work on.</h3>
<div class="outline-text-3" id="text-org3ee8176">
<p>
I have 2 goals however I might just work on one if I fail at my number one
priority.
</p>
</div>
</div>
<div id="outline-container-orgafdefab" class="outline-3">
<h3 id="orgafdefab">Don&rsquo;t make the goal too easy to achieve</h3>
<div class="outline-text-3" id="text-orgafdefab">
<p>
Pick a goal where the level of performance that is above what you think you can do something that&rsquo;s just out of reach.
</p>
</div>
</div>
<div id="outline-container-orgf798a2c" class="outline-3">
<h3 id="orgf798a2c">Measurable goal</h3>
<div class="outline-text-3" id="text-orgf798a2c">
<p>
The verb action you are doing to do. Write it out on paper.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd9a84f7" class="outline-2">
<h2 id="orgd9a84f7">How To Change Your Life In 30 Days With Reverse Goal Setting</h2>
<div class="outline-text-2" id="text-orgd9a84f7">
<p>
From Cal Newport (author)
1:29 hours. I only watched half so far.
</p>

<p>
<a href="https://youtu.be/USOn1E6g2N0">https://youtu.be/USOn1E6g2N0</a>
</p>

<p>
More specific video on Reverse goal setting also called &rsquo;Backwards planning&rsquo;
<a href="https://www.youtube.com/watch?v=7vQ9zxT6uhs">https://www.youtube.com/watch?v=7vQ9zxT6uhs</a>. Haven&rsquo;t done the exercise from this.
</p>

<p>
The Cal Newport video has a good an insight:
</p>

<p>
He calls it &rsquo;Checklist productivity&rsquo; people think the main thing separating them
from their hard goals is information. You underestimate the effort.
</p>

<p>
Hearing that I realized I seem to think I can eliminate most of the chance from
my life if I have the right information.
</p>

<p>
Instead maybe it would be better if I focus on my process and decision making instead.
</p>
</div>
</div>
<div id="outline-container-orgd78bb45" class="outline-2">
<h2 id="orgd78bb45">The Only Goal That Matters.</h2>
<div class="outline-text-2" id="text-orgd78bb45">
<p>
4 mins. <a href="https://www.youtube.com/watch?v=KOYNnHMPZGM">https://www.youtube.com/watch?v=KOYNnHMPZGM</a>
</p>

<p>
Take aways:
The outcome isn&rsquo;t the goal. The goal is who you become.
Sometimes we are blinded by the goal and don&rsquo;t look after our self&rsquo;s.
</p>

<p>
I wonder how I can give myself qualities like self compassion and resilience.
</p>
</div>
</div>
<div id="outline-container-org5d69019" class="outline-2">
<h2 id="org5d69019">How to Make 2024 The Best Year of Your Life</h2>
<div class="outline-text-2" id="text-org5d69019">
<p>
Ali Abdaal
<a href="https://www.youtube.com/watch?v=c_DOG_mXz5w">https://www.youtube.com/watch?v=c_DOG_mXz5w</a>
</p>

<p>
Take away:
</p>
<ul class="org-ul">
<li>plan your ideal week.
I did this is in Google calendar.</li>
</ul>
</div>
</div>
<div id="outline-container-org2e88c2e" class="outline-2">
<h2 id="org2e88c2e">Other things I did</h2>
<div class="outline-text-2" id="text-org2e88c2e">
</div>
<div id="outline-container-org95a7299" class="outline-3">
<h3 id="org95a7299">mood board</h3>
<div class="outline-text-3" id="text-org95a7299">
<p>
I did a mood board just with all the things I&rsquo;m interested in doing in 2024. I
already have my top priority and it was good to just see what I&rsquo;m interested in
doing.
</p>
</div>
</div>
<div id="outline-container-org862eae4" class="outline-3">
<h3 id="org862eae4">WOOP exercise</h3>
<div class="outline-text-3" id="text-org862eae4">
<p>
evidence based exersize for people to fulfill their wishes, set preferences, and
change their habits. <a href="https://woopmylife.org/">https://woopmylife.org/</a>
</p>

<p>
I&rsquo;m trying it out to see if it works.
</p>

<p>
See this video if your interested in the information about &rsquo;WOOP&rsquo;
also called Mental Contrasting with
Implementation Intentions&rsquo;
</p>

<p>
<a href="https://youtu.be/Zz59q8wHECk?si=Zl4bvl5nDtT-5E3R">https://youtu.be/Zz59q8wHECk?si=Zl4bvl5nDtT-5E3R</a>
</p>

<p>
Here my result of the exercise
</p>

<p>
dec 28 2023
</p>

<p>
wish in the next 4 weeks - that I am disciplined
</p>

<p>
outcome - i will finally be free and not controlled by my desires
</p>

<p>
obstacle - my emotions that want to not work win
</p>

<p>
plan - i will use skills
</p>

<ul class="org-ul">
<li>if i feel like not working then I will be mindful and use skills to help myself work</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-01-01 Mon 12:18</p>
</div>
</body>
</html>
